# Бесанец Алексей
print("start code...\n")

books = [{"title": "1984", "author": "Джордж Оруэлл", "year" : "1949"},
         {"title": "Сто лет одиночества", "author": "Габриэль Гарсиа Маркес", "year" : "1967"},
         {"title": "Анна Каренина", "author": "Лев Толстой", "year" : "1877"},
         {"title": "Мастер и Маргарита", "author": "Михаил Булгаков", "year" : "1967"},
         {"title": "Посторонний", "author": "Альбер Камю", "year" : "1942"}]

count = 1
for i in books:
    print(f"-----------------------------Книга {count}-----------------------------")
    print(f"Название: {i["title"]}, Автор: {i["author"]},")
    print(f"------------------------------{i["year"]}-------------------------------\n")
    count += 1


print("end code...\n\n")